# Naive Bayes
### Predict Titanic Survival using Naive Bayes

Make a naive assumption that features such as male, class, age, cabin, fare etc. are independent of each other.

Usage:
- Spam detection
- Handwritten digit recognition
- Weather prediction
- Face detection
- News article categorization

In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
inputs = df.drop('Survived', axis='columns')
target = df.Survived

In [4]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [6]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head(9)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3   NaN   8.4583       0     1
6       1  54.0  51.8625       0     1
7       3   2.0  21.0750       0     1
8       3  27.0  11.1333       1     0

In [7]:
# To check any NA values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(9)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0

In [19]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [20]:
len(x_train)

712

In [21]:
len(x_test)

179

### Creating the Naive Bayes model

In [22]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [23]:
model.fit(x_train, y_train)

GaussianNB()

In [24]:
model.score(x_test, y_test)

0.7932960893854749

In [27]:
x_test.head(9)

     Pclass        Age     Fare  female  male
374       3   3.000000  21.0750       1     0
10        3   4.000000  16.7000       1     0
347       3  29.699118  16.1000       1     0
185       1  29.699118  50.0000       0     1
420       3  29.699118   7.8958       0     1
38        3  18.000000  18.0000       1     0
539       1  22.000000  49.5000       1     0
457       1  29.699118  51.8625       1     0
631       3  51.000000   7.0542       0     1

In [28]:
y_test.head(9)

374    0
10     1
347    1
185    0
420    0
38     0
539    1
457    1
631    0
Name: Survived, dtype: int64

In [33]:
# model.predict(x_test)
model.predict(x_test[:9])

array([1, 1, 1, 0, 0, 1, 1, 1, 0], dtype=int64)

In [34]:
model.predict_proba(x_test[:9])

array([[0.02369955, 0.97630045],
       [0.02526612, 0.97473388],
       [0.04994814, 0.95005186],
       [0.86353986, 0.13646014],
       [0.9882038 , 0.0117962 ],
       [0.04029157, 0.95970843],
       [0.00352446, 0.99647554],
       [0.00370753, 0.99629247],
       [0.98765131, 0.01234869]])